# coding: utf-8
#########################################################################
# 网站: <a href="http://www.crazyit.org">疯狂Java联盟</a>               #
# author yeeku.H.lee kongyeeku@163.com                                  #
#                                                                       #
# version 1.0                                                           #
#                                                                       #
# Copyright (C), 2001-2018, yeeku.H.Lee                                 #
#                                                                       #
# This program is protected by copyright laws.                          #
#                                                                       #
# Program Name:                                                         #
#                                                                       #
# <br>Date:                                                             #
#########################################################################
# 定义变量b，并为其赋值
b = 5
if b > 4:
    # 如果b>4，则执行下面的执行体，只有一行代码作为代码块
    print("b大于4")
else:
    # 否则，执行下面的执行体，只有一行代码作为代码块
    b -= 1
# 对于下面代码而言，它已经不再是条件执行体的一部分，因此总会执行
print("b不大于4")

# 定义变量c，并为其赋值
c = 5
if c > 4:
    # 如果c>4，则执行下面的执行体，将只有c--一行代码为执行体
    c -= 1
# 下面是一行普通代码，不属于执行体
print("c大于4")
# 此处的else将没有if语句，因此编译出错
else
    # 否则，执行下面的执行体，只有一行代码作为代码块
    print("c不大于4")
